Repository: Amazingstar0306/spero_updater
Catalog: SPERO_Updater/MainForm.*.resx
Languages: fr, it

# Str_Btn_No
source: NO
fr: NON

# Str_Btn_Yes
source: YES
fr: OUI
it: SI

# Str_Connected
source: CONNECTED
fr: CONNECTE
it: CONNESSO

# Str_Disconnected
source: DISCONNECTED
fr: DECONNECTE
it: NON CONNESSO

# Str_Error_BluetoothUpdateCmdBegin
source: Bluetooth Firmware Update Failed : UPDATE_CMD_BEGIN
fr: Echec de la mise à jour du micrologiciel Bluetooth : UPDATE_CMD_BEGIN
it: Aggiornamento firmware bluetooth non riuscito : UPDATE_CMD_BEGIN

# Str_Error_BluetoothUpdateFileNotFound
source: Bluetooth Firmware Update Failed : Update File Not Found
fr: Echec de la mise à jour du micrologiciel Bluetooth : Fichier de mise à jour introuvable
it: Aggiornamento firmware bluetooth non riuscito : File di aggiornamento non trovato

# Str_Error_Bluetooth_HidProcessFailed
source: Bluetooth Firmware Update Failed : HID_PROCESS_FAILED
fr: Echec de la mise à jour du micrologiciel Bluetooth : HID_PROCESS_FAILED
it: Aggiornamento firmware bluetooth non riuscito : HID_PROCESS_FAILED

# Str_Error_Bluetooth_HidProcessInProgressing
source: Bluetooth Firmware Update Failed : HID_PROCESS_IN_PROGRESSING
fr: Echec de la mise à jour du micrologiciel Bluetooth : HID_PROCESS_IN_PROGRESSING
it: Aggiornamento firmware bluetooth non riuscito : HID_PROCESS_IN_PROGRESSING

# Str_Error_Bluetooth_HidProcessSuceess
source: Bluetooth Firmware Update Failed : HID_PROCESS_SUCCESS
fr: Echec de la mise à jour du micrologiciel Bluetooth : HID_PROCESS_SUCCESS
it: Aggiornamento firmware bluetooth non riuscito : HD_PROCESS_SUCCESS

# Str_Error_FirmwareVersionSame
source: SPERO Firmware version is already updated to V{0:0.0}, Do you want to perform the update anyways?
fr: La version du micrologiciel SPERO est déjà mise à jour V{0:0.0}, voulez-vous quand même effectuer la mise à jour?
it: La versione del firmware di SPERO è già aggiornata alla V{0:0.0}, vuoi comunque eseguire l'aggiornamento?

# Str_Error_FirwareVersionNewer
source: Current SPERO Firmware Version is Future Version V{0:0.0}, Do you want to Downgrade the Firmware anyways? Performing this action could damage the product or make it become unresponsive!
fr: La version actuelle du micrologiciel SPERO est la future version V{0:0.0}. Voulez-vous quand même rétrograder le micrologiciel? Cette action pourrait endommager le produit ou le rendre insensible!
it: L'attuale versione del firmware SPERO è la futura versione V{0:0.0}, vuoi comunque eseguire il downgrade del firmware? L'esecuzione di questa azione potrebbe danneggiare il prodotto o lo stesso potrebbe non rispondere!

# Str_Error_FlashUpdateCmd
source: Flash Firmware Update Failed : UPDATE_CMD
fr: Echec de la mise à jour du micrologiciel Flash : UPDATE_CMD
it: Aggiornamento firmware Flash non riuscito : UPDATE_CMD

# Str_Error_FlashUpdateCmdBegin
source: Flash Firmware Update Failed : UPDATE_CMD_BEGIN
fr: Echec de la mise à jour du micrologiciel Flash : UPDATE_CMD_BEGIN
it: Aggiornamento firmware Flash non riuscito : UPDATE_CMD_BEGIN

# Str_Error_FlashUpdateCmdEnd
source: Flash Firmware Update Failed : UPDATE_CMD_END
fr: Echec de la mise à jour du micrologiciel Flash : UPDATE_CMD_END
it: Aggiornamento firmware Flash non riuscito : UPDATE_CMD_END

# Str_Error_FlashUpdateFileNotFound
source: Flash Firmware Update Failed : Update File Not Found
fr: Echec de la mise à jour du micrologiciel Flash : Fichier de mise à jour introuvable
it: Aggiornamento firmware Flash non riuscito : File di aggiornamento non trovato

# Str_Error_FlashUpdateFileSize
source: Flash Firmware Update Failed : Update File Size Error
fr: Echec de la mise à jour du micrologiciel Flash : Erreur de taille de fichier de mise à jour
it: Aggiornamento firmware Flash non riuscito : dimensione errata del File di aggiornamento

# Str_Error_GetDeviceInfo
source: MCU GET_DEVICE_INFO Error
fr: MCU GET_DEVICE_INFO Erreur
it: Errore MCU GET_DEVICE_INFO

# Str_Error_McuHwVersion
source: MCU Hardware Version Error
fr: Erreur de version du matériel MCU
it: Errore versione hardware MCU

# Str_Error_McuUpdateCmd
source: MCU Firmware Update Failed : UPDATE_CMD
fr: Echec de la mise à jour du micrologiciel MCU : UPDATE_CMD
it: Aggiornamento firmware MCU non riuscito : UPDATE_CMD

# Str_Error_McuUpdateCmdBegin
source: MCU Firmware Update Failed : UPDATE_CMD_BEGIN
fr: Echec de la mise à jour du micrologiciel MCU : UPDATE_CMD_BEGIN
it: Aggiornamento firmware MCU non riuscito : UPDATE_CMD_BEGIN

# Str_Error_McuUpdateCmdEnd
source: MCU Firmware Update Failed : UPDATE_CMD_END
fr: Echec de la mise à jour du micrologiciel MCU : UPDATE_CMD_END
it: Aggiornamento firmware MCU non riuscito : UPDATE_CMD_END

# Str_Error_McuUpdateCmdKey
source: MCU Firmware Update Failed : UPDATE_CMD_KEY
fr: Echec de la mise à jour du micrologiciel MCU : UPDATE_CMD_KEY
it: Aggiornamento firmware MCU non riuscito : UPDATE_CMD_KEY

# Str_Error_McuUpdateFileNotFound
source: MCU Firmware Update Failed : Update File Not Found
fr: Echec de la mise à jour du micrologiciel MCU : Fichier de mise à jour introuvable
it: Aggiornamento firmware MCU non riuscito : File di aggiornamento non trovato

# Str_Error_McuUpdateFileSize
source: MCU Firmware Update Failed : Update File Size Error
fr: Echec de la mise à jour du micrologiciel MCU: Erreur de taille de fichier de mise à jour
it: Aggiornamento firmware MCU non riuscito : dimensione errata del File di aggiornamento

# Str_Error_OpenComPort
source: Open USB Serial Port Failed, Please Select The Correct Port
fr: Echec de l'ouverture du port USB, veuillez sélectionner le bon port
it: Apertura della porta seriale USB non riuscita, selezionare la porta corretta

# Str_Error_OpenFile
source: Can Not Open File
fr: Impossible d'ouvrir le fichier
it: Impossibile aprire il File

# Str_Error_Reset
source: SPERO Reset Failed
fr: Échec de la réinitialisation SPERO
it: Ripristino di SPERO non riuscito

# Str_Error_SelectComponent
source: Please select the software component(s) that you want to update
fr: Veuillez sélectionner le(s) composant(s) logiciel(s) que vous souhaitez mettre à jour
it: Seleziona i/le componenti del software che desideri aggiornare

# Str_Error_SerialOpen
source: Can Not Open USB Serial Port
fr: Impossible d'ouvrir le port série USB
it: Impossibile aprire la porta seriale USB

# Str_Error_SerialPortClosed_Bluetooth0
source: USB Serial Port Closed : BLUETOOTH_0
fr: Port série USB fermé : BLUETOOTH_0
it: Porta seriale USB chiusa : BLUETOOTH_0

# Str_Error_SerialPortClosed_Bluetooth1
source: USB Serial Port Closed : BLUETOOTH_1
fr: Port série USB fermé : BLUETOOTH_1
it: Porta seriale USB chiusa : BLUETOOTH_1

# Str_Error_SerialPortClosed_Mcu0
source: USB Serial Port Closed : MCU_0
fr: Port série USB fermé : MCU_0
it: Porta seriale USB chiusa : MCU_0

# Str_Error_SerialPortClosed_Mcu1
source: USB Serial Port Closed : MCU_1
fr: Port série USB fermé : MCU_1
it: Porta seriale USB chiusa : MCU_1

# Str_FirmwareVersion
source: Firmware Version
fr: Version du micrologiciel
it: Versione del Firmware

# Str_FormClosingWarning
source: Update is in progress, are you sure you want to close the updater? This could cause the product to become unresponsive!
fr: La mise à jour est en cours, êtes-vous sûr de vouloir fermer le programme de mise à jour? Cela pourrait endommager le produit!
it: L'aggiornamento è in corso, sei sicuro di voler chiudere il programma di aggiornamento? Ciò potrebbe causare la mancata risposta del prodotto!

# Str_HardwareVersion
source: Hardware Version
fr: Version matérielle
it: Versione dell' Hardware

# Str_InitiateUpdate
source: Initiate Update
fr: Lancer la mise à jour
it: Avvia aggiornamento

# Str_ModelNumber
source: Model Number
fr: Numéro de modèle
it: Numero del modello

# Str_ProductInformation
source: Product Information
fr: Information produit
it: Informazioni del prodotto

# Str_ProductName
source: Product Name
fr: Nom du produit
it: Nome del prodotto

# Str_SerialNumber
source: Serial Number
fr: Numéro de série
it: Numero di serie

# Str_Status
source: Status
fr: Statut
it: Stato

# Str_UpdateBluetooth
source: Update the Bluetooth
fr: Mettre à jour le Bluetooth
it: Aggiorna il Bluetooth

# Str_UpdateBluetoothFormat
source: UPDATE THE BLUETOOTH (V{0:0.0} TO V{1:0.0})
fr: METTRE A JOUR LE BLUETOOTH (V{0:0.0} À V{1:0.0})
it: AGGIORNA IL BLUETOOTH (DA {0:0.0} A V{1:0.0})

# Str_UpdateComplete
source: Update Complete
fr: Mise à jour terminée
it: Aggiornamento completato

# Str_UpdateError
source: UPDATER ERROR
fr: ERREUR DE MISE A JOUR
it: ERRORE PROGRAMMA DI AGGIORNAMENTO

# Str_UpdateFlash
source: Update the Flash
fr: Mettre à jour le Flash
it: Aggiorna Flash

# Str_UpdateFlashFormat
source: UPDATE THE FLASH (V{0:0.0} TO V{1:0.0})
fr: METTRE A JOUR LE FLASH (V{0:0.0} TO V{1:0.0})
it: AGGIORNA FLASH (DA V{0:0.0} A V{1:0.0})

# Str_UpdateMcu
source: Update the Mcu
fr: Mettre à jour le MCU
it: Aggiorna l' MCU

# Str_UpdateMcuFormat
source: UPDATE THE MCU (V{0:0.0} TO V{1:0.0})
fr: METTRE A JOUR LE MCU (V{0:0.0} TO V{1:0.0})
it: AGGIORNA L' MCU (DA V{0:0.0} A V{1:0.0})

# Str_UpdateNow
source: UPDATE NOW
fr: Mettre à jour maintenant
it: AGGIORNA ADESSO

# Str_UpdaterVersion
source: Updater Version
fr: Mise à jour version
it: Aggiornamento Versione

# Str_UpdateSuccess
source: Update has Completed Succesfully
fr: Mise à jour terminée avec succès
it: L'aggiornamento è stato completato con successo

# Str_UpdateTimeRemaining
source: (UPDATING) ESTIMATED TIME
fr: Estimation du temps de mise à jour
it: TEMPO STIMATO (AGGIORNAMENTO)

# Str_UpdateWarning
source: UPDATER WARNING
fr: Avertissement de mise à jour
it: AVVISO AGGIORNAMENTO

# Str_UpdatingOptions
source: Updating Options
fr: Options de mise à jour
it: Opzioni di aggiornamento

# Str_UserExperience
source: User Experience Updater
fr: Mise à jour de l'expérience utilisateur
it: aggiornamento dell'esperienza utente
